# -*- coding: utf-8 -*-
"""
@Time ： 2023/1/17 21:33
@Auth ： 大雄
@File ：public.py
@IDE ：PyCharm
@Email:3475228828@qq.com
"""
import ctypes
import os, time
import struct

from Application.model.model import gl_info, td_info

debug = True
project_path = os.path.join(os.path.dirname(__file__), )
path = project_path + "\\Resources\\static\\"
temp_image_path = path + "image"
desktop_name = "com.ldmnq.launcher3/com.android.launcher3.Launcher"
ld_ratio = 960, 540, 240
desktop_delay_num = 60  # 模拟器启动超时时间
app_delay_num = 30  # 点击谷歌后,不进入游戏的超时时间
start_app_delay = 360  # 启动app到登录谷歌界面超时时间
restart_num = 3  # 重启模拟器和重启app最大次数
process_max_time = 60 * 30

# 加载dll
if struct.calcsize('P') * 8 == 32:
    dll = ctypes.CDLL(project_path + os.path.sep + "lib/32/libtwo.dll")
else:
    dll = ctypes.CDLL(project_path + os.path.sep + "lib/64/libtwo.dll")


class Script_public:
    class 宝宝巴士脚本:
        package_name = "com.sinyee.babybus.piano"  # 包名
        apk_name = path + "soft\\" + "Piano_8.64.00.04_apkcombo.com.apk"
        resources_path = path + "baobaobashi\\"
        task_class_name = "BaoBaoBaShi_task"  # 执行任务的类名
        ms = {
            "游戏主界面": ["游戏主界面.bmp", 0.9],
            "任务": {
                "music": ["music.bmp", 0.9],
                "music2": ["music2.bmp", 0.9],
                "sound": ["sound.bmp", 0.9],
                "sound2": ["sound2.bmp", 0.9],
                "game": ["game.bmp", 0.9],
                "game2": ["game2.bmp", 0.9],
            },
            "back": ["back.bmp", 0.9],
        }
        loc = {

        }

    class Timo脚本:
        package_name = "net.idik.timo"  # 包名
        apk_name = path + "soft\\" + "Timo.apk"
        resources_path = path + "Timo\\"
        task_class_name = "Timo_task"  # 执行任务的类名
        ms = {
            "感谢使用Timo笔记": ["感谢使用Timo笔记.bmp", 0.95],
            "同意并使用": ["同意并使用.bmp", 0.95],
            "创建已选主题并开始体验": ["创建已选主题并开始体验.bmp", 0.95],

            "游戏主界面": ["游戏主界面.bmp", 0.95],
            "想法": ["想法.bmp", 0.98],
            "加号": ["加号.bmp", 0.95],
            "提示": ["提示.bmp", 0.95],
            "右上角": ["右上角.bmp", 0.95],
            "删除": ["删除.bmp", 0.95],
            "查看文本": [20, 260, 79, 299],
        }
        loc = {
            "下拉": [[193, 380], [81, 111]],  # 滑动
            "下一页": [888, 501],
            "想法": [455, 165],
            "加号": [563, 162],
            "写些什么": [132, 507],
            "后退": [42, 84],
            "点击文本": [43, 283],
            "右上角": [936, 92],
            "删除": [715, 243],
        }

    class TSN:
        package_name = "net.chinesegamer.tsn"  # 包名
        apk_name = path + "soft\\" + "tsn_Release_ThirdParty.apk"
        resources_path = path + "tsn\\"
        task_class_name = "Tsn_task"  # 执行任务的类名
        token_dir_path = resources_path + "\\image\\token_num\\"
        csv_name = time.strftime('%Y-%m-%d', time.localtime(time.time())) + "_tsn.csv"  # 根据雷电路径，自动生成在雷电路径所属盘根目录
        task_max_time = 60 * 6  # 副本任务最长时间
        bubing_task_time = 60 * 18  # 补兵任务最长事件
        paiqian_task_max_time = 60 * 6  # 派遣任务最长事件
        update_delay = 60 * 10  # 更新最长等待时间
        dianxiaoer_time = 60*2
        ms = {
            "服务器尚未连接请稍后再试": ["服务器尚未连接请稍后再试.bmp", 0.95],
            "找不到更新资源": ["找不到更新资源.bmp", 0.95],
            "游戏主界面": ["游戏主界面.bmp", 0.95],
            "谷歌按钮": ["谷歌按钮.bmp", 0.95],
            "下载更新": ["下载更新.bmp", 0.95],
            "功能按钮": ["功能按钮.bmp", 0.95],
            "雷电商店停止运行": ["雷电商店停止运行.bmp", 0.95],
            # "功能菜单": ["功能菜单.bmp", 0.95],
            "福利界面": ["福利界面.bmp", 0.95],
            "福利按钮": [556,0,792,115,"福利按钮.bmp", "", 0.9, 5],

            "限时优惠": ["限时优惠.bmp", 0.95],
            "每日签到": ["每日签到.bmp", 0.95],
            "登入好礼": ["登入好礼.bmp", 0.95],
            "登入好礼-天数范围": [345, 276, 358, 298],

            "信件按钮": ["信件按钮.bmp", 0.95],
            "信件界面": ["信件界面.bmp", 0.95],

            "登入好礼-领取": ["登入好礼-领取.bmp", 0.95],
            "登入公告": ["登入公告.bmp", 0.95],
            "今日登入不再提示": ["今日登入不再提示.bmp", 0.95],
            "天数列表": [
                ["第一天.bmp", "", 0.95, 5],
                ["第二天.bmp", "", 0.95, 5],
                ["第三天.bmp", "", 0.95, 5],
                ["第四天.bmp", "", 0.95, 5],
                ["第五天.bmp", "", 0.95, 5],
                ["第六天.bmp", "", 0.95, 5],
                ["第七天.bmp", "", 0.95, 5],
                ["第八天.bmp", "", 0.95, 5],
                ["第九天.bmp", "", 0.95, 5],
                ["第十天.bmp", "", 0.95, 5],
                ["第十一天.bmp", "", 0.95, 5],
                ["第十二天.bmp", "", 0.95, 5],
                ["第十三天.bmp", "", 0.95, 5],
                ["第十四天.bmp", "", 0.95, 5],
            ],
            "天数范围": [284, 251, 414, 303],

            # 派遣
            "派遣按钮": ["派遣按钮.bmp", 0.95],
            "请选择武将": ["请选择武将.bmp", 0.95],
            "确定武将": ["确定武将.bmp", 0.95],
            "出发": ["出发.bmp", 0.95],
            "快速完成": ["快速完成.bmp", 0.95],
            "花费元宝购买-是": ["花费元宝购买-是.bmp", 0.95],
            "派遣武将-领取": ["派遣武将-领取.bmp", 0.95],
            "派遣窗口": ["派遣窗口.bmp", 0.95],
            # "每日限购9次": [424, 50, 554, 245, "每日限购9次", 0.95, ((0, 0, 221), (180, 30, 255))],

            # 挖矿
            "挖矿按钮": ["挖矿按钮.bmp", 0.95],
            "喂食-max": ["喂食-max.bmp", 0.95],
            "挖矿界面": ["挖矿界面.bmp", 0.95],

            # 市集
            "市集按钮": ["市集按钮.bmp", 0.95],
            "市集-加号": ["市集-加号.bmp", 0.95],
            "市集-max": ["喂食-max.bmp", 0.95],
            "市集-存入吞食币范围": [446, 257, 521, 275, "", 0.95, "token_num"],
            "全部完成": [730, 256, 820, 309, "全部完成.bmp", "", 0.95, 5],
            "转移成功": ["转移成功.bmp", 0.95],
            "资料处理中": ["资料处理中.bmp", 0.95],
            "上传失败": ["上传失败.bmp", 0.95],
            # 补兵流程
            "游戏账号登录": ["游戏账号登录.bmp", 0.95],
            "创建玩家资料": ["创建玩家资料.bmp", 0.95],
            "使用谷歌账号登录": ["使用谷歌账号登录.bmp", 0.95],
            "创建角色界面": ["创建角色界面.bmp", 0.95],
            "属性选择界面": ["属性选择界面.bmp", 0.95],
            "攻击6次": ["攻击6次.bmp", 0.98],
            "HPSPEXP": [7, 10, 134, 104, "HPSPEXP.bmp", "", 0.95, 5],
            "HPSPEXP2": [7, 10, 134, 104, "HPSPEXP2.bmp", "", 0.95, 5],
            "HPSPEXP3": [4, 2, 138, 78, "HPSPEXP3.bmp", "", 0.95, 5],
            "HPSPEXP4": [4, 2, 138, 78, "HPSPEXP4.bmp", "", 0.95, 5],
            "空白页": [301, 435, 882, 530, "空白页.bmp", "", 0.99, 6],
            "任务自宅-下一步": ["任务自宅-下一步.bmp", 0.95],
            "可切换对话目标": ["可切换对话目标.bmp", 0.95],
            "开启任务列表": ["开启任务列表.bmp", 0.95],
            "吞噬奇遇-前往": ["吞噬奇遇-前往.bmp", 0.95],
            "头盔带好": ["头盔带好.bmp", 0.95],
            "窗口x": [707, 46, 922, 281, "窗口x.bmp", "", 0.99, 5],
            "点击攻击": [653, 476, 828, 531, "点击攻击.bmp", "", 0.95, 5],
            "选择攻击对象": ["选择攻击对象.bmp", 0.95],
            "开启状态": [608, 467, 765, 534, "开启状态.bmp", "", 0.95, 5],
            "重置点数": ["重置点数.bmp", 0.95],
            "完成确定分配点数": ["完成确定分配点数.bmp", 0.95],
            "我已经准备好了": [206, 402, 537, 500, "我已经准备好了.bmp", "", 0.95, 6],
            "选择攻击指令": ["选择攻击指令.bmp", 0.95],
            "攻击巴豆妖": ["攻击巴豆妖.bmp", 0.95],
            "选择网罗": ["选择网罗.bmp", 0.95],
            "网罗巴豆妖": ["网罗巴豆妖.bmp", 0.95],
            "满血巴豆妖":[293,136,413,215,"满血巴豆妖.bmp","",0.98,5],
            "半血巴豆妖": [293,136,413,215,"半血巴豆妖.bmp", "",0.98,5],
            "回复型水系": ["回复型水系.bmp", 0.95],
            "点选功能钮": ["点选功能钮.bmp", 0.95],
            "选择队伍": ["选择队伍.bmp", 0.95],
            "出战": ["出战.bmp", 0.95],
            "出战2": ["出战2.bmp", 0.95],
            "离开此处-要": ["离开此处-要.bmp", 0.95],
            "没想去不想回答": ["没想去不想回答.bmp", 0.95],
            "弹窗展开": ["弹窗展开.bmp", 0.95],
            "头盔带好2": ["头盔带好2.bmp", 0.95],
            "穿上装备": ["穿上装备.bmp", 0.95],
            "关闭背包": ["关闭背包.bmp", 0.95],
            "豚郡普户": ["豚郡普户.bmp", 0.95],
            "走出豚郡": ["走出豚郡.bmp", 0.95],
            "豚郡街道": ["豚郡街道.bmp", 0.95],
            "豚郡城门": ["豚郡城门.bmp", 0.95],
            "豚郡客栈": ["豚郡客栈.bmp", 0.95],
            "店小二": [777,451,848,479,"店小二.bmp", "",0.95,5],
            "武将": ["武将.bmp", 0.95],
            "存入": ["存入.bmp", 0.95],
            "已打开背包界面": ["已打开背包界面.bmp", 0.95],
            "10000赞宝箱": [565, 179, 815, 328, "10000赞宝箱.bmp", "", 0.99, 5],
            "5000赞宝箱": [565, 179, 815, 328, "5000赞宝箱.bmp", "", 0.95, 5],
            "2500赞宝箱": [565, 179, 815, 328, "2500赞宝箱.bmp", "", 0.95, 5],
            "开服礼包宝箱": [565, 179, 815, 328, "开服礼包宝箱.bmp", "", 0.95, 5],
            "宝箱使用": ["宝箱使用.bmp", 0.95],
            "背包": [782, 480, 837, 537, "背包.bmp", "000000-030303", 0.95, 6],
            "FTP连接失败确定": ["FTP连接失败确定.bmp", 0.95],
            "与server连线中断": [183, 386, 413, 503, "与server连线中断.bmp", "", 0.95, 5],
            "关闭队伍": [798, 57, 846, 109, "关闭队伍.bmp", "", 0.95, 6],
            "选择账号": ["选择账号.bmp", 0.95],
            "下一步": [761, 425, 877, 498, "下一步.bmp", "", 0.95, 5],
            "头盔装备": ["头盔装备.bmp", 0.95],

            "重复登入断线-是": [745, 447, 869, 505, "重复登入断线-是.bmp", "", 0.95, 5],
            "领出": [389, 176, 483, 232, "领出.bmp", "", 0.95, 5],
            "客栈": [156, 62, 249, 120, "客栈.bmp", "", 0.95, 5],

        }
        loc = {
            "雷电商店停止运行确定按钮": [716, 335],
            "下载更新确定按钮": [503, 347],
            "谷歌按钮": [282, 412],
            "关闭限时优惠按钮": [150, 88],
            "福利上滑": [206, 28],
            "登入好礼-领取": [792, 287],
            "福利界面-关闭按钮": [828, 104],
            "登入公告-关闭按钮": [783, 80],
            "功能按钮": [940, 509],

            # 信件
            "信件按钮": [823, 402],
            "信件-一键领取": [292, 443],
            "信件-删除空白": [428, 445],
            "信件-关闭按钮": [782, 106],

            # 派遣
            "派遣按钮": [816, 462],
            "关闭派遣窗口按钮": [830, 104],
            # 挖矿
            "挖矿按钮": [762, 294],
            "喂食": [[262, 394], [422, 395], [585, 394], [728, 393]],
            "喂食-确定": [502, 315],
            "挖矿关闭按钮": [792, 100],

            # 市集
            "市集-加号按钮": [447, 368],
            "市集按钮": [597, 353],
            "吞食币数量位置": [493, 271],
            "市集-存入-确定": [498, 324],
            "吞食币MIN": [387, 262],
            "吞食币MAX": [571, 270],
            "市集-存入-发送至交易市场": [341, 412],
            # 补兵流程
            "以xx身份继续": [656, 422],
            "创建玩家资料-创建": [664, 486],
            "使用谷歌账号登录-继续": [622, 401],
            "转移或处理中的确定": [475, 335],
            "使用谷歌账号登录下滑": [[714, 488], [710, 93]],
            # 创建角色
            "随机造型": [727, 367],
            "创建角色-下一步": [922, 504],
            # 属性选择界面
            "攻击加号": [753, 195],
            "随机名称": [378, 417],
            "主线任务": [856, 116],
            "空白页": [],
            "切换对话目标": [928, 455],
            "任务": [837, 69],
            "吞噬奇遇-前往": [664, 416],
            "吞噬奇遇-前往2": [606, 289],
            "背包": [861, 511],
            # "背包2": [806,506], # 完成任务的背包
            "头盔-背包位置": [597, 204],
            "头盔-装备按钮": [575, 339],
            "状态-关闭": [821, 92],
            "点击攻击": [874, 508],
            "攻击巴豆妖":[359,215],
            "选择攻击对象": [289, 189],
            "状态按钮": [803, 511],
            "重置点数": [679, 426],
            "增加属性": [762, 277],
            "重置点数-确定": [748, 419],
            "重置点数-最后一次": [666, 426],
            "我已经准备好了": [419, 479],
            "网罗按钮": [822,505],
            "巴豆妖位置":[355,218],
            "队伍": [758, 510],
            "关闭世界弹窗1": [25, 316],
            "关闭世界弹窗2": [27, 393],
            "前往豚郡城门": [934, 411],
            "对话": [871, 418],
            "豚郡客栈": [340, 203],
            "店小二": [380, 182],
            "状态窗口关闭x": [817, 90],
            "与server连线中断": [802, 483],
            "选择账号上一个": [70, -75],

            "穿上装备偏移": [157, 13],
            "选择队伍偏移": [154, 13],
            "选择网罗偏移": [157, 13],
            "攻击偏移": [157, 13],
            "攻击": [879,518],
            "": [],
            "": [],
            "": [],
        }

